{
  "main": {
    "name":"Griffin Clark",
    "description":"I am a third year Queen's University student studying Engineering Physics with a specialization in Computing. My interests include AI/ML, quantum computing, data aggregation/manipulation and mathematical modelling. Check out my experience and work below",
    "image":"profilepic.jpg",
    "bio":"Born in Denver, Colorado and Raised in Fredericton, a small town on the east coast of Canada, I have been raised to love the outdoors! Hiking, running, skiing and scuba diving are a few of my favourite outdoor activities that I have been able to do on my many around the world. Aside from staying active and being outdoors, I love to eat!! There is nothing better than discovering a new favourite restaurant, whether thats in my college town of Kingston, Ontario or on the other side of the world. After learning to code in my first year of Uni, a new interest of mine lies in data science and mathematical modelling. I am currently searching for an internship in the tech industry and my dual citizenship allows me to work legally in both the USA and Canada!",
    "contactmessage":"I love meeting new people and gaining new connections. Shoot me a message to start a conversation!",
    "email": "griffinclark10@gmail.com",
    "phone": "(506) 476-2939",
    "github":"https://github.com/griffinclark10",
    "project":"https://www.linkedin.com/in/griffin-clark-a02513146/",
    "address":{
      "city":"Kingston",
      "state":"Ontario"
    },
    "website": "http://www.griffinsclark.com",
    "resumedownload":"GriffinClark_Resume2021-08.pdf",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/griffin.stephensclark/",
        "className":"fa fa-facebook"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/griffin-clark-a02513146/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/griffin.cclark/?hl=en",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/griffinclark10",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Softwares/Languages that I have worked with in the past!",
    "education":[
      {
        "school":"Queen's University",
        "degree":"Bachelors of Engineering Physics, Computing Specialization",
        "graduated":"April 2023",
        "description":"After a year of studying physics in a general BSc degree, I chose to transfer to an Engineering degree which allows me to work in a team setting, something I much prefer over individual work. Pure Engineering physics is a niche degree, not being offered at most schools, but it allows me to combine my interest in theoretical physics (Quantum mechanics, Electromagnetism Classical physics, etc.) with a new found love for computing through the EngPhys specialization option. This has allowed me to take classes such as Data Structures and Algorithms, "
      }
      
    ],
    "work":[
      {
        "company":"McDonald Institute",
        "title":"Research and Outreach Fellow",
        "years":"May 2021 - September 2021",
        "description":"Dark Matter was first theorized by Zwicky in 1933 and ever since, hundreds of thousands of physicists have dedicated much time and effort to discover this elusive mass. This summer, I joined that list. Using Queen's supercomputer server, I leveraged software (GIZMO, DICE, yt) to model the formation of stars and Galaxies to shed light on dark matter's effect on these processes. The outreach portion of my position came in the form of the research, creation and presentation of a college-length course on astrophysics, taught to a group of 7 high school students over the course of 6 weeks."
      },
      {
        "company":"Queen's University",
        "title":"Teaching Assistant for PHYS 104/106",
        "years":"September 2020 - May 2021",
        "description":"In my first year at Queen's, I took a physics couse that would ultimately leed me to spcialize my education in physics. This past year, I was able to assist teaching and marking in that same class. Each Wednesday, I held a 3-hour virtual help session for students with questions about the weekly assignment or general course content. I also helped with the marking of weekly assignments through the use of crowdmark, marking up to 150 assignments and getting grades back to students within 2 days of submission. "
      }
    ],
    "skills":[
      {
        "name":"Python",
        "level":"80%"
      },
      {
        "name":"Java",
        "level":"55%"
      },
      {
        "name":"C",
        "level":"45%"
      },
      {
        "name":"Linux",
        "level":"70%"
      },
      {
        "name":"GIZMO",
        "level":"60%"
      },
      {
        "name":"Git",
        "level":"45%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"A Tweet A Stock",
        "short_description":"Stock projection AI model using sentiment analysis of public tweets about the company.",
        "description":"On January 28th, 2021, Gamestop stock reached a peak trading price of 500$ a share. This 30 fold increase started from amateur investors betting against short sellers on r/wallstreetbets and it quickly took over social media, causing the stock price to soar. A group of us wanted to see if there was a real correlation between the public opinion of a company and its stock price. We chose to make a model after Tesla and to use Tweets about the company to gauge the public sentiment. I chose to bypass the Twitter API in order to access 1M+ historical tweets to ensure a large training dataset. I then applied an centiment analysis to each tweet ans averaged out the sentiment between each trading period. We then trained both a KNN and RFF models to predict the direction of the stock price to 90% accuracy. Future goals include making some sort of chrome extension and aggregating data from other social media sites. ",
        "image":"Users/griffinclark/portfolio/public/images/portfolio/stock.jpeg",
        "url":"https://github.com/18AnirudhaV/ATweetAStock.git",
        "button_label":"Check out the GitHub!",
        "button_type":"github"
      },
      {
        "title":"Helping Hand",
        "short_description":"AI model that reads and translates sign language in real time using NLP.",
        "description":"A more accessible world is a more connected world, which is why a couple students and I wanted to create a real time sign language transaltor. This project focused heavily on NLP and used a public training and testing dataset of ASL letters. The 93% accurate CNN was made using popular machine learning modules Keras and TensorFlow. We chose the CNN as this type of model typically works well with image classification. Finally, we made an interface using Javascript and CSS that would accept live video and translate in real time. ",
        "image":"images/portfolio/ASL.jpeg",
        "url":"HelpingHand.pdf",
        "button_label":"Check out the paper!",
        "button_type":"document"
      }
    ]
  }
}
